{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.11.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 126], "dtype": "float32", "sparse": false, "ragged": false, "name": "lstm_input"}}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 30, 126], "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.9833441376686096, "scale": 0.00011688470840454102, "original_dtype": "float32"}}, {"name": "batch_normalization/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02224282723139314, "scale": 0.00016117990747386334, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0, "scale": 0.0006662278198728374, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.6689716577529907, "scale": 0.0001029825678058699, "original_dtype": "float32"}}, {"name": "batch_normalization_1/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.9775664806365967, "scale": 0.00020349539962469362, "original_dtype": "float32"}}, {"name": "batch_normalization_1/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.032087930861641384, "scale": 0.000243090385315465, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.008170018903911114, "scale": 0.002113383383873631, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.670291006565094, "scale": 0.025865889296812168, "original_dtype": "float32"}}, {"name": "dense/kernel", "shape": [64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.24515499963479884, "scale": 0.0018858076894984527, "original_dtype": "float32"}}, {"name": "dense/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.024155732974702238, "scale": 0.00021959757249729307, "original_dtype": "float32"}}, {"name": "dense_1/kernel", "shape": [64, 5], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3194207759464488, "scale": 0.0024761300460965025, "original_dtype": "float32"}}, {"name": "dense_1/bias", "shape": [5], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02362932001843172, "scale": 0.00019691100015359767, "original_dtype": "float32"}}, {"name": "lstm/lstm_cell/kernel", "shape": [126, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11177364885807038, "scale": 0.0008870924512545268, "original_dtype": "float32"}}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17039433998220108, "scale": 0.0013631547198576085, "original_dtype": "float32"}}, {"name": "lstm/lstm_cell/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.01622215597068562, "scale": 0.004055538992671405, "original_dtype": "float32"}}, {"name": "lstm_1/lstm_cell/kernel", "shape": [128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.14536815957695828, "scale": 0.0011446311777713251, "original_dtype": "float32"}}, {"name": "lstm_1/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2314386288909351, "scale": 0.001766707090770497, "original_dtype": "float32"}}, {"name": "lstm_1/lstm_cell/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02039377530123673, "scale": 0.004078755060247346, "original_dtype": "float32"}}]}]}