{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.11.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "VSIgn_LSTM", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 63], "dtype": "float32", "sparse": false, "ragged": false, "name": "lstm_1_input"}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 30, 63], "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0005000000237487257, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.9732351899147034, "scale": 0.00019014559540094113, "original_dtype": "float32"}}, {"name": "batch_normalization/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02900555011104135, "scale": 0.00019598344669622533, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0, "scale": 0.001480161091860603, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.046171002089977264, "scale": 6.677750863280951e-05, "original_dtype": "float32"}}, {"name": "batch_normalization_1/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.9901676177978516, "scale": 0.0003251963970707912, "original_dtype": "float32"}}, {"name": "batch_normalization_1/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0628978382138645, "scale": 0.00044927027295617496, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1425371617078781, "scale": 0.006344637975973242, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.08242448419332504, "scale": 0.0378039740172087, "original_dtype": "float32"}}, {"name": "dense_1/kernel", "shape": [64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2784331896725823, "scale": 0.0021093423460044115, "original_dtype": "float32"}}, {"name": "dense_1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.021391969656243043, "scale": 0.00032412075236731884, "original_dtype": "float32"}}, {"name": "lstm_1/lstm_cell/kernel", "shape": [63, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1501901287658542, "scale": 0.0010962783121595196, "original_dtype": "float32"}}, {"name": "lstm_1/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1906069285729352, "scale": 0.001443991883128297, "original_dtype": "float32"}}, {"name": "lstm_1/lstm_cell/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.03723198512897772, "scale": 0.00413688723655308, "original_dtype": "float32"}}, {"name": "lstm_2/lstm_cell/kernel", "shape": [128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1714838296175003, "scale": 0.0013941774765650432, "original_dtype": "float32"}}, {"name": "lstm_2/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2574108320124009, "scale": 0.0019209763583014994, "original_dtype": "float32"}}, {"name": "lstm_2/lstm_cell/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02901017778352195, "scale": 0.004144311111931707, "original_dtype": "float32"}}, {"name": "output/kernel", "shape": [64, 5], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3536646727253409, "scale": 0.0026997303261476406, "original_dtype": "float32"}}, {"name": "output/bias", "shape": [5], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02446061007532419, "scale": 0.00021270095717673207, "original_dtype": "float32"}}]}]}